draw-rails/app/controllers/drawings_controller.rb

    def save
        drawing = Drawing.create(picture_link: params[:link], key: params[:key])
---
INSERT INTO "drawings" ("picture_link", "key") VALUES ($1, $2) RETURNING "id"  [["picture_link", "https://i.imgur.com/8TGeXHV.png"], ["key", "ed54edzjmzhzfip82dole9"]]

    def getdrawing
        @drawing = Drawing.find_by(key: params[:key])
---
SELECT "drawings".* FROM "drawings" WHERE "drawings"."key" = ? LIMIT ?  [["key", "savedrawing"], ["LIMIT", 1]]